//Побудувати ієрархію класів відповідно до варіанта завдання.
//        Згідно завдання вибрати суперклас (базовий клас) та підкласи (похідні класи). В
//        класах задати поля, які характерні для кожного класу. Для всіх класів
//        розробити метод Show(), який виводить дані про об’єкт класу. Розробити
//        програму, яка вводить інформацію про об’єкти заданих сутностей згідно
//        варіанту в масив типу суперкласу та друкує введений масив (з використанням
//        методу Show()).

// 12.Двигун, двигун внутрішнього згоряння, дизель, реактивний двигун.
public class EngineTask {
    public static void main(String[] args) {
        System.out.println(" Lab 3");
        System.out.println(" Task 1");
    }
}
